[
  {
    "id":"0",
    "text":"First Last\n123-1456-7891|abc@gmail.ca |linkedin.com\/in\/... |github.com\/...\nEducation\n(no-name Canadian university)City, ON\nBachelor of Engineering, Computer Engineering (Co-op) Sep. 2025 – April 2030\nExperience\nAI Data Annotation SpecialistDec. 2025 – Present\nOutlier AI Waterloo, ON (Remote)\n•Labeled and described visual data for AI model training, reviewing1,000+images per month\n•Identified differences in image sets for dataset quality, achieving95% instruction accuracycompliance\n•Contributed to3-5production ready datasets, helping improve model precision\nTechnical Projects LeadSep. 2025 – Present\nUniversity IEEE Student Branch City, ON\n•Developed and maintained the club website using React and JavaScript, improving usability and providing a central\nplatform for event information and resources that streamlined communication for100+members\n•Coordinated technical initiatives across the club, including planning and integrating hardware and software projects\ninto workshops, hackathons, and member events, increasing participation and engagement by65%\n•Designed and fabricated custom PCBs for club workshops, enabling hands-on hardware learning experiences for\n70+participants, and assisted attendees with KiCad, soldering, and troubleshooting during workshop sessions\nRobotics Research Assistant (Incoming)May 2026 – Sep. 2026\nUniversity of x City, ON\n•Preparing to support robotics research and development, including experimental design and prototyping.\n•Set to assist with hardware-software integration on autonomous and sensor-driven systems\nProjects\nH2@Home|C++, JavaScript, React, Git, IoTNov. 2025\n•(university name) Engineering Competition 2025 —Gold, 1st Place\n•Developed and implemented automation and monitoring software for a decentralized hydrogen generation system\n•Built a real-time data analytics and control dashboard inReact and JavaScript, implementing live data\nvisualization, component state mapping, andFirebaseconnectivity over WiFi, improving insight speed by70%\n•Programmed theESP32 in C++, enabling communication with relays, gas sensors, and hardware modules\nthrough GPIO control, ADC readings, and safety-trigger logic, applied across5+ hardware components\nSUD - Smart Underwriting Dashboard|Python, JavaScript, React, DockerSep. 2025\n•Developed a full-stack dashboard to streamline and automate insurance underwriting decisions\n•Improved workflow efficiency by approximately70%by implementing AI agents and process optimization\n•Implemented data visualization features to display key financial and risk metrics for underwriters.\n•Rapidly developed in a collaborative environment at Hack the North 2025\nGroup|React, JavaScript, Git, Android StudioAug. 2025\n•Designed and developed a mobile app to help groups organize tasks, events, and communication in one platform.\n•Implemented core features including user authentication, real-time messaging, and morein less than 5 days.\n•Built the front end withReact Nativeand used backend databases (Firebase\/Node.js) for real-time data sync.\n•Focused on clean UI\/UX design to ensure accessibility and ease of use across devices.\nTechnical Skills\nLanguages: JavaScript, Python, C\/C++, GCC\/Clang, Java, HTML\/CSS\nFrameworks: React, TailwindCSS, Node.js, Flask, WordPress\nDeveloper Tools: Git, GitLab, Docker, Google Cloud Platform, Firebase, VS Code, PyCharm, Linux, Raspberry Pi\n"
  }
]